# Length Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipePressureDropData..::..Length Property
PipePressureDropData Class See Also
---
The length of the pipe. Units: (ft).
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double Length { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Length As Double
	Get
```

Visual C++
---
```text
public:
property double Length {
	double get ();
}
```

# See Also
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace